way = input("введите что-то одно: север, юг, запад или восток ")
if way == "север" or way == "запад" or way == "восток":
    print("Коридор оказался на столько долгим: твой факел потух и ты навечно остался в этом лабиринте")
elif way == "юг":
    print("Ты вспомнил , как тебе говорила жена, что не стоит идти за этими сокровищами в тот таинственный лабиринт- заблудишься. Смахнув скупую мужскую слезу, ты продолжаешь путь дальше")
    way = input("введите что-то одно: север, юг, запад или восток ")
    if way == "юг" or way == "восток":
        print("Коридор оказался на столько долгим: твой факел потух и ты навечно остался в этом лабиринте")
    elif way == "запад":
        print("Ты вспомнил , как тебе говорила жена, что не стоит идти за этими сокровищами в тот таинственный лабиринт- заблудишься. Смахнув скупую мужскую слезу, ты продолжаешь путь дальше")
        way = input("введите что-то одно: север, юг, запад или восток ")
        if way == "запад" or way == "север":
            print("Коридор оказался на столько долгим: твой факел потух и ты навечно остался в этом лабиринте")
        elif way == "юг":
            print("ПОЗДРАВЛЯЮ!!! Ты выбрался из лабиринта!")
        elif way == "восток":
            print("ты только что от туда пришёл, а в предыдущей комнате тебя уже поджидал минотавр...исход этой встречи ты уже никому не расскажешь.")
        else:
            print("введён неверный параметр,программа закрывается")
    elif way == "север":
        print("ты только что от туда пришёл, а в предыдущей комнате тебя уже поджидал минотавр...исход этой встречи ты уже никому не расскажешь.")
    else:
        print("введён неверный параметр,программа закрывается")
else:
    print("введён неверный параметр,программа закрывается")